In [11]:
import pandas as pd
df = pd.read_csv('book1.csv')
print(df)

       name  class  roll no
0      ashu     12        3
1  himanshu     11        4
2    chetan     13        5

In [15]:
print(df['roll no'].dtype)

int64

In [16]:
df.head()

       name  class  roll no
0      ashu     12        3
1  himanshu     11        4
2    chetan     13        5

In [17]:
df.tail()

       name  class  roll no
0      ashu     12        3
1  himanshu     11        4
2    chetan     13        5

In [21]:
print(df['class'].dtype)

int64

# Wrinting into csv file

In [5]:
import pandas as pd
df1 = pd.DataFrame([[1,2,3,4],[2,3,4,5],[3,4,5,6],[4,5,6,7]], columns=['A','B','C','D'])
df1.head()

   A  B  C  D
0  1  2  3  4
1  2  3  4  5
2  3  4  5  6
3  4  5  6  7

In [7]:
df1.to_csv('csv/export.csv', index=False)